# Магічні методи __str__ та __repr__ в Python відіграють ключову роль у представленні об'єктів у вигляді рядків. 
# Знання та правильне використання цих методів дозволяє контролювати, як об'єкти вашого класу відображаються 
# і використовуються, що є важливою частиною розробки Python програм.

# магічний метод __repr__ приймає лише один аргумент (звичайно це self) і повинен повертати рядок.

# Метод __repr__ призначений для створення офіційного рядкового представлення об'єкта

# Тому коли ми хочемо у випадках, коли застосунок повинен відобразити об'єкт, 
# виводити якусь корисну інформацію, ми повинні модифікувати цей метод. Наприклад, клас точки на площині в Декартових координатах:

class Point:
    def __init__(self, x, y):
        self.x = x
        self.y = y

    def __repr__(self):
        return f"Point(x={self.x}, y={self.y})"

point = Point(2, 3)
print(repr(point))  # Виводить: Point(x=2, y=3)
print(type(point))

# Виконайте цей код у консолі Python і ви побачите Point(x=2, y=3).
