# Магічний метод, який ми найчастіше використовуємо, — це метод __init__.
# __init__ - метод відповідає за ініціалізацію об'єкта. Коли ви створюєте об'єкт класу, то спочатку створюється порожній об'єкт, 
# який містить лише обов'язкові службові атрибути. Після того як об'єкт створено, 
# автоматично викликається метод __init__, який ми можемо модифікувати під наші потреби

class Human:
    def __init__(self, name: str, age: int = 0):
        self.name = name
        self.age = age

    def say_hello(self) -> str:
        return f'Hello! I am {self.name}'

bill = Human('Bill')
print(bill.say_hello())
print(bill.age)

jill = Human('Jill', 20)
print(jill.say_hello())
print(jill.age)

# В цьому прикладі ми створили клас Human, у якому визначили метод __init__. 
# У цьому методі ми додаємо об'єктам цього класу поля name та age. 
# Зверніть увагу, що метод __init__ може приймати аргументи позиційні та/або іменні, 
# як і будь-який інший метод. Коли ми створюємо об'єкт класу Human, 
# ми повинні класу передати обов'язково хоча б один аргумент, оскільки метод __init__ повинен приймати обов'язково name.

# Магічний метод __init__ не обов'язково повинен приймати аргументи та містити лише створення полів. 
# Цей метод можна використовувати для реалізації будь-яких дій, які вам потрібні на етапі, 
# коли об'єкт вже створений та його потрібно ініціалізувати.


# Додамо перевірку віку, щоб встановити, чи є людина повнолітньою, і відповідне поле is_adult, 
# а також використаємо метод __init__ для виклику іншого методу класу під час ініціалізації.

class Human:
    def __init__(self, name: str, age: int = 0):
        self.name = name
        self.age = age
        # Виклик методу під час ініціалізації
        self.is_adult = self.__check_adulthood()  
        
        # Приклад логування
        print(f"Створено Human: {self.name}, Вік: {self.age}, Дорослий: {self.is_adult}")

    def say_hello(self) -> str:
        return f'Hello! I am {self.name}'

    def __check_adulthood(self) -> bool:
        return self.age >= 18

bill = Human('Bill')
print(bill.say_hello())
print(f"Вік: {bill.age}, Дорослий: {bill.is_adult}")

jill = Human('Jill', 20)
print(jill.say_hello())
print(f"Вік: {jill.age}, Дорослий: {jill.is_adult}")

# У цьому прикладі, коли створюється об'єкт класу Human, наш магічний метод __init__ виконує наступні дії. 
# Він, як і було до цього, ініціалізує поля name та age. Але тепер він визначає, чи є особа дорослою, 
# використовуючи метод check_adulthood, і зберігає результат в поле is_adult. 
# Також ми додали рядок який виводить інформацію про створення об'єкта.